S = 'Spam'              #присвоюємо змінній S значення Spam

print(len(S))           #виводимо на екран кількість символів змінної S

print(S[0])             #виводимо 1 елемент змінної S
print(S[1])             #виводимо 2 елемент змінної S

print(S[-1])            #виводимо перший з кінця елемент змінної S
print(S[-2])            #виводимо другий з кінця елемент змінної S

print(S[len(S)-1])      #цей вираз також виводить перший з кінця елемент S

print(S)                #вивід змінної S
print(S[1:3])           #зріз S зі зміщенням 1 до 2 (не 3)
print(S[1:])            #зріз всього після першого елемента
print(S[0:3])           #зріз всього крім останнього елемента
print(S[:3])            #теж саме, що і вираз вище
print(S[:-1])           #зріз всього крім останнього елемента
print(S[:])             #вся строка S

print(S + 'xyz')        #конкатинація (об'єднання) строк
print(S * 8)            #повторення S 8 разів
