S = 'shrubbery'

L = list(S)                 #створюємо список з символів елемента S в елемент L
print(L)                    #виводимо список

L[1] = 'c'                  #змінюємо другий символ списку L на символ 'c'
print(L)                    #виводимо список

B = bytearray(b'spam')      #гібрид байтів/списка
B.extend(b'eggs')           #об'єднання spam і eggs в одну строку
print(B)                    #вивід елемента B
print(B.decode())           #декодування в звичайну строку і вивід на екран