import math                         #імпорт математичних функцій
import random

print(123 + 222)                    #додавання цілих чисел
print(1.5 * 4)                      #множення числа з плаваючою комою
print(2 ** 100)                     # 2 в степені 100
print(len(str(2 ** 10000)))         #len показує кількість символів виразу(2 в степені 10000)
print(math.pi)                      #число ПІ
print(math.sqrt(85))                #квадратний корінь числа 85
print(random.random())              #за допомогою random.random обираються рандомні числа з плаваючою комою
print(random.choice([1, 2, 3, 4]))  #random.choice обирає будь-яке число з [1, 2, 3, 4]